Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/introduction_to_the_irish_system/index.html.txt.tmx
Source language: en
Languages: ga

source: Introduction to the Irish System
ga: Tús eolais ar chóras na hÉireann

source: This document provides an overview of housing in Ireland
ga: Soláthraíonn an doiciméad seo forléargas ar thithíocht in Éirinn

source: Outline of health care services in Ireland, including public and private health care, and health insurance
ga: Tá cur síos anseo ar sheirbhísí cúram sláinte in Éirinn, san áireamh tá cúram sláinte phoiblí agus phríobháideach

source: An overview of income tax and other taxes in Ireland
ga: Léargas ginearálta ar cháin ioncaim agus ar chánacha eile in Éirinn

source: Moving your children to primary school
ga: Do pháiste a aistriú chuig bunscoil in Éirinn

source: Introduces the system of education in Ireland at primary level and information describes the procedures involved in enrolling a child in primary school
ga: Tá cur síos anseo ar an gcóras bunscolaíochta in Éirinn agus eolas ar na córais iarratais a bhaineann leo agus ar do pháiste a chur chuig do rogha scoil

source: Moving your children to secondary school
ga: Do pháisté a aistriú chuig meánscoil Éireannach

source: Different schooling options available in the secondary school system in Ireland and outlines the state examination system
ga: Tá cur síos anseo ar na roghanna sa chóras scoile ag an dara leibhéal in Éirinn agus ar an gcóras scruduithe Stáit

source: Moving to Ireland and your social security entitlements
ga: Do chearta leasa shóisialta agus tú ag bogadh go hÉirinn

source: This document discusses your social welfare entitlements if you move to Ireland from abroad
ga: Pléann an cháipéis seo do chearta leasa shóisialta má bhogann tú go hÉirinn ón gcoigrích

source: Rights of citizens and residents of Ireland to vote in elections
ga: Tá cur síos anseo ar chearta shaoránaigh na hÉireann agus iad siúd go bhfuil conaí orthu in Éirinn a vótá a chaitheamh in aon toghchán

source: Political system at national level
ga: An córas polaitiúil ag leibhéal náisiúnta

source: This description of the way in which the political system operates at mational level includes an outline of the Oireachtas
ga: Tá cur síos sa cháipéis seo ar an gcóras polaitiúil ag leibhéal náisiúnta, chomh maith le cur síos ar an Oireachtas

source: It also contains an explanation of the political terms used
ga: Tá míniú tugtha freisin ar na téarmaí polaitiúla a úsáidtear

source: Political system at local level
ga: An córas polaitiúil ag leibhéal aitiúil

source: The role and responsibility of local authorities and overview of local government system at county/city level and at sub-county level
ga: Tá cur síos anseo ar an córas rialtais ag leibheal áitiúil, ag leibheal contae/cathrach agus ag leibheal fochontae

source: Social welfare system in Ireland
ga: An córas leasa shóisialaigh in Éirinn

source: What is the social welfare system in Ireland?
ga: Céard é an córas leasa shóisialaigh in Éirinn?

source: How is it organised and who can apply for social welfare benefits? This document provides an overview of the system and includes links to more information
ga: Cén chaoi a bhfuil sé eagraithe agus cé na daoine gur féidir leo iarratas a dhéanamh ar shochair leasa shóisialaigh?

source: This document is in: Social Welfare > Irish social welfare system
ga: This document is in: Leas Sóisialach > Córas Leasa Shóisialaigh na hÉireann

source: Most Read in "Moving Country"
ga: Ábhar is mó éilimh i "Ag bogadh tíre"

source: Irish citizenship through birth or descent
ga: Saoránacht d'Éirinn ó bhreith nó ó ghinealach

source: Visa requirements for entering Ireland
ga: Riachtanais víosa le teacht isteach in Éirinn

source: Coming to work in Ireland
ga: Ag teacht go hÉirinn chun oibriú

source: Becoming an Irish citizen
ga: Ag éirí i do shaoránach Éireannach
